In [4]:
import pandas as pd
import numpy as n
import re

In [2]:
str = '104 men in class room 205 kill 12 people with 10 guns '

In [3]:
patern1 = '\d'
patern2 = '\d+'

In [6]:
result1 = re.findall(patern1, str)
result1

['1', '0', '4', '2', '0', '5', '1', '2', '1', '0']

In [7]:
result2 = re.findall(patern2 , str)
result2

['104', '205', '12', '10']

In [8]:
result3 = re.search(patern1, str)
result3

In [16]:
result4 = re.search(patern2, str)
result4

In [20]:
result5 = re.split(patern1,str)
result5

['',
 '',
 '',
 ' men in class room ',
 '',
 '',
 ' kill ',
 '',
 ' people with ',
 '',
 ' guns ']

In [21]:
result6 = re.split(patern2,str)
result6

['', ' men in class room ', ' kill ', ' people with ', ' guns ']

In [22]:
result6[2]

' kill '

In [23]:
n = 2
result7 = re.split(patern1, str , n)
result7

['', '', '4 men in class room 205 kill 12 people with 10 guns ']

In [25]:
n = 2
result8 = re.split(patern2, str , n)
result8

['', ' men in class room ', ' kill 12 people with 10 guns ']

In [28]:
result9 = re.sub(patern1,'hello', str)
result9

'hellohellohello men in class room hellohellohello kill hellohello people with hellohello guns '

In [29]:
result10 = re.sub(patern2,'hello', str)
result10

'hello men in class room hello kill hello people with hello guns '

In [31]:
result11 = re.subn(patern2,'hi',str,2)
result11

('hi men in class room hi kill 12 people with 10 guns ', 2)

In [32]:
patern3 = 'kill'
result12 = re.sub(patern3 , 'love',str)
result12

'104 men in class room 205 love 12 people with 10 guns '

# extract Number and Letter from String

In [42]:
# clean number
x = '1x38s90sss112'
patern0 = '\D' 
result13 = re.sub(patern0,'', x)
result13

'13890112'

In [50]:
# clean letter
x = '1s38a90j969j11a25d'
patern0 = '\d' 
result14 = re.sub(patern0,'', x)
result14

'sajjad'

In [62]:
# get just watter 
x = '125watter 52ali'
patern0 = '\d+' 
result14 = re.split(patern0, x)
result14[1]

'watter '

In [137]:
# Extract data From string

x = """      ali:52 -fati:92 - hoshang:33-shaina:17 - haidy:19-        tarane:20
      - shahin:100-mohammad:20
      """

patern1='-'
patern2=':'

list=[]
df = pd.DataFrame()

result1 = re.split(patern1, x)
for i in range (0,len(result1)):
      Name = (re.split(patern2,result1[i]))[0]
      Code = int((re.split(patern2,result1[i]))[1])
      x = pd.DataFrame([[Name,Code]],columns=['name','score'])
      df = pd.concat([df,x])

In [138]:
df

             name  score
0             ali     52
0            fati     92
0         hoshang     33
0          shaina     17
0           haidy     19
0          tarane     20
0          shahin    100
0        mohammad     20